test/serverless-artillery/serverless-artillery-test-users-api.yml
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
    - duration: 10
      arrivalRate: 10

scenarios:
  - flow:
    - get:
        url: "/users"
        capture:
          json: "$.users"
          as: "users"