test/serverless-artillery/serverless-artillery-test-users-api.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api/users?"
  phases:
    - duration: 60
      arrivalRate: 2
      name: warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 60
      name: ramp up stress test
scenarios:
  - flow:
    - get:
      url: "/"
      capture:
        json: "$.user"
        as: "users"