test/serverless-artillery/serverless-artillery-test-users-api.yml
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
    - duration: 300
      arrivalRate: 100
      name: "users api test"

scenarios:
  - flow:
    - get:
      url: "/users"
      json:
      afterResponse: "logResponse"
      capture:
        json: "$.users"
        as: "users"