test/serverless-artillery/serverless-artillery-test-users-api.yml
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
<<<<<<< HEAD
    - duration: 300
      arrivalRate: 100
      name: "users api test"

=======
    - duration: 150
      arrivalRate: 50
      name: "users api test"
>>>>>>> 62a7c24ef55eb068941f0affe2f2885f324093b2
scenarios:
  - flow:
    - get:
      url: "/users"
      json:
      afterResponse: "logResponse"
      capture:
        json: "$.users"
<<<<<<< HEAD
        as: "users"
=======
        as: "users"
>>>>>>> 62a7c24ef55eb068941f0affe2f2885f324093b2