test/serverless-artillery/serverless-artillery-test-users-id-api.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
    -
      duration: 300
      arrivalRate: 10
scenarios:
  -
    flow:
      -
        get:
          url: "/users/1"
          json:
            name: "name"