test/serverless-artillery/serverless-artillery-test-users-id-api.yml

config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
    -
      duration: 300
      arrivalRate: 10
scenarios:
  -
    flow:
      -
        get:
          url: "/users/1"
          json:
            name: "name"