test/serverless-artillery/serverless-artillery-test-users-id-tasks-api.yml
# Test api endpoint /users/{user_id}/tasks
#
# Initial testing setup:
#   duration: 200
#   arrivalRate: 1
#   rampTo: 10
#
# See: https://github.com/Nordstrom/serverless-artillery
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api/users/1/tasks?"
  phases:
    -duration: 200
     arrivalRate: 1
     rampTo: 10
  
  -
    flow:

        - get:
            url: "/"
    capture:
      json: "$.taskId"
      as: "taskId"